<template>
    <section class="faq">

		<base-modal ref="modal_main">
			<template v-slot:close>
				<div @click="closeModal">
					<base-icon name="thin/xmark" class="icon icon-close"></base-icon>
				</div>
			</template>
			<template v-slot:content>
				<div class="modal-content">
					<blocks-contact title="Получите ответ специалиста <br>прямо сейчас"></blocks-contact>
				</div>
			</template>
		</base-modal>

        <div class="container">
            <div class="row">
                <div class="col-12">
                    <h3 class="mb-5">Часто задаваемые вопросы / ответы по мобилизации</h3>
                </div>
            </div>
            <div class="row">
                <div class="col-12 col-md-6">
                    <base-accordion class="faq__accordion">
                        <div class="accodion-overlay" v-show="counts == 2"></div>
                        <template v-for="(item, i) in items">
                            <base-accordion-item :key="i" v-if="i <= counts">
                                <template slot="accordion-trigger">
                                    <h5 class="accordion-title">{{item.title}}</h5>
                                </template>
                                <template slot="accordion-content">
                                    <div v-html="item.content"></div>
                                </template>
                            </base-accordion-item>
                        </template>
                    </base-accordion>
                    <div class="buttons mt-3 mb-5">
                        <div class="hider" @click="hider" v-if="counts == 2"><span>Развернуть полностью</span><base-icon name="regular/angle-down" class="icon ml-2"></base-icon></div>
                        <div class="hider active" @click="hider" v-else><span>Свернуть</span><base-icon name="regular/angle-up" class="icon ml-2"></base-icon></div>
                    </div>
                    <h3 class="mb-2">Остались вопросы?</h3>
                    <p>Наш специалист проконсультирует вас</p>
                    <div class="buttons mt-4 mb-5">
                        <div class="btn btn-primary btn-middle" @click="openModal">Задать вопрос</div>
                    </div>
                </div>
                <div class="col-12 col-md-6">
                    <img src="/images/faq-people.webp" alt="">
                    <!--<div class="image">
                        <img src="/images/faq-people.jpg" alt="">
                    </div>-->
                </div>
            </div>
        </div>
    </section>
</template>
<script>
export default {
    data() {
        return {
            counts: 2,
            items: [
                {
                    title: "У МЕНЯ/МУЖА/ЖЕНЫ/БРАТА КОНЧАЕТСЯ КОНТРАКТ ЧЕРЕЗ ДЕНЬ/НЕДЕЛЮ/МЕСЯЦ, В СВЯЗИ С МОБИЛИЗАЦИЕЙ УВОЛЯТ ЛИ МЕНЯ/МУЖА/ЖЕНУ/БРАТА С ВОЕННОЙ СЛУЖБЫ?",
                    content: "<b>Отвечаем:</b> Нет, не уволят.<br>\
<br>Контракты о прохождении военной службы, заключенные военнослужащими, продолжают свое действие до окончания периода частичной мобилизации, за исключением случаев увольнения военнослужащих с военной службы по основаниям, установленным настоящим Указом.( А именно по возрасту - по достижении ими предельного возраста пребывания на военной службе;\
<br>б) по состоянию здоровья - в связи с признанием их военно-врачебной комиссией не годными к военной службе, за исключением военнослужащих, изъявивших желание продолжить военную службу на воинских должностях, которые могут замещаться указанными военнослужащими; (ТОЛЬКО КАТЕГОРИЯ - Д)\
<br>в) в связи с вступлением в законную силу приговора суда о назначении наказания в виде лишения свободы);"
                },
                {
                    title: "МОЙ СЫН/БРАТ/СВАТ/МУЖ СЕЙЧАС СРОЧНИК, УВОЛЯТ ЛИ ЕГО?",
                    content: "<b>Отвечаем:</b><br>уволят по окончании срочки, после чего он обязан встать на учёт в военкомат , где ему выдадут мобилизационное предписание и он будет вновь призван, но уже имея статус равного военнослужащему по контракту;"
                },
                {
                    title: "ЧТО БУДЕТ ЕСЛИ Я НЕ ПРИМУ ПОВЕСТКУ ИЗ РУК ВОЕНКОМАТА?",
                    content: "<b>Отвечаем:</b><br>К сожалению, есть законы мобилизации. И мобпредписания. Не взять в руки повестку или не расписаться в ней (ведь вручать будут должностные лица, которые обладают полномочиями зафиксировать, что делал вызываемый) никак не поможет от подачи в розыск и возбуждению дел об уклонении при мобилизации; "
                },
                {
                    title: "ЕСЛИ Я ЖИВУ В ЛЕСУ, ПУСТЫНЕ, МОНАСТЫРЕ И НЕ ЗНАЛ, ЧТО МЕНЯ ИЩЕТ ВОЕНКОМАТ, ПОНЕСУ ЛИ Я ЗА ЭТО ОТВЕТСТВЕННОСТЬ?",
                    content: "<b>Отвечаем:</b><br> если человек действительно жил в лесу/степи/горах, без связи с внешним миром, не трудясь, не пользуясь медпомощью, не платя налоги, не имея счетов и карт банков, питался природными ресурсами, не создавал социальных связей и не находился без регистрации ни в одном месте, попадающем под понятие 'населённый пункт', то есть совсем в необитаемых местах, то ничего не будет. Если же что-то было не так, как выше описано, то гражданин был обязан встать на воинский учёт по новому месту проживания (даже без постоянной регистрации). То есть, через два года найдут признаки уклонения либо он обнаружит висящим себя в розыске по плану мобилизации;"
                },
                {
                    title: "МЕНЯ УВОЛИЛИ ПО НУК 10 ЛЕТ НАЗАД, ПОДЛЕЖУ ЛИ Я ПРИЗЫВУ ПО МОБИЛИЗАЦИИ ?",
                    content: "<b>Отвечаем:</b><br> Да подлежите, как и все на общих основаниях;"
                },
                {
                    title: "Я ЗАКЛЮЧИЛ КРАТКОСРОЧНЫЙ КОНТРАКТ 2 МЕСЯЦА НАЗАД, ОН ТОЖЕ БУДЕТ ПРОДЛЕН?",
                    content: "<b>Отвечаем:</b><br>Контракты добровольцев будут продлены. Они приравнены к 'классическим' контрактникам;"
                },
                {
                    title: "Я УЖЕ УСТРАИВАЮСЬ НА КОНТРАКТ, ЖДУ ПРИКАЗА, ПОМЕШАЕТ ЛИ МОБИЛИЗАЦИЯ МОИМ ПЛАНАМ ПОПАСТЬ В КОНКРЕТНУЮ ЧАСТЬ?",
                    content: "<b>Отвечаем:</b><br>отделение запаса вашего военного комиссариата знает о вас, раз ваши документы в работе. То есть, вас изъяли из списков запасников, вы грубо говоря, кандидат на контракт. Поэтому пока в мобилизационные списки вас не внесут."
                },
                {
                    title: "МНЕ 45 ЛЕТ, ПРИШЛА ПОВЕСТКА, ПРЕЗИДЕНТ ЖЕ ОБЪЯВИЛ ЧАСТИЧНУЮ МОБИЛИЗАЦИЮ , ПОЧЕМУ МЕНЯ ХОТЯТ ПРИЗВАТЬ , ВЕДЬ Я ДОЛЖЕН ПРИЗЫВАТЬСЯ ВО 2-3 ОЧЕРЕДЬ?",
                    content: "<b>Отвечаем:</b><br> мобилизация впервые проходит в новейшей истории России . Да, в новостях сказали, что идёт первая очередь и в первую очередь призывают тех-то и тех-то. Но мы не видим никаких нормативных документов на данный случай, именно частичной мобилизации, возможно ли призвать по начатой частичной мобилизации лиц низших званий с опытом службы, имеющих ВУС, но после 45 лет, но именно сегодня/завтра. Пока вызывают и до 45 и после. Возможно, для уточнения данных учёта запаса, возможно, для освидетельствования ВВК, возможно, для вручения мобпредписания, возможно и призывают. Возможно, они стали по критериям запаса первой очередью. Оспаривать очерёдность? Пока не можем сказать, пока нет данных."
                },
                {
                    title: "ЕСЛИ Я ОТКАЖУСЬ ОТ УЧАСТИЯ В СПЕЦОПЕРАЦИИ МНЕ ГРОЗИТ УГОЛОВНАЯ ОТВЕТСТВЕННОСТЬ?",
                    content: "<b>Отвечаем:</b><br>Да согласно недавним поправкам в уголовный кодекс, к отказникам теперь будет применяться уголовная ответственность."
                },
                {
                    title: "Я ЕДИНСТВЕННЫЙ КОРМИЛЕЦ В СЕМЬЕ, ЖЕНА ДОМОХОЗЯЙКА УХАЖИВАЕТ ЗА РЕБЕНКОМ ИНВАЛИДОМ, ПОДЛЕЖУ ЛИ Я ПРИЗЫВУ ПО МОБИЛИЗАЦИИ?",
                    content: "<b>Отвечаем:</b><br>Да, так как кому ухаживать за инвалидом, есть. А супруг, будучи призван по плану мобилизации, становится контрактником. У него предусмотрена оплата. Точно такая же, как и у 'классических' военнослужащих по контракту. Он может перед убытием указать рапортом счета супруги, на которые будут перечислять деньги. Указать, все ли или какой-то процент от его заработка. Либо переводить средства сам."
                },
                {
                    title: "Я ОТЕЦ ТРОИХ ДЕТЕЙ , ПОДЛЕЖУ ЛИ Я МОБИЛИЗАЦИИ?",
                    content: "<b>Отвечаем:</b><br>Для предоставления отсрочки необходимо иметь 3 детей до 16 лет и 4-тым должна быть беременна супруга не менее чем на 22 неделе беременности;"
                },
                {
                    title: "Я МНОГОДЕТНАЯ МАТЬ, СТАРШЕГО СЫНА ЗАБРАЛИ НА СВО, ИМЕЮТ ЛИ ПРАВО ЗАБРАТЬ СРЕДНЕГО И МЛАДШЕГО СЫНА?",
                    content: "<b>Отвечаем:</b><br>На сегодняшний день, нет никаких нпа запрещающих призывать по мобилизации членов семей уже мобилизованных на фронт. Подобный указ был при императоре Александре 2, который запрещал забирать у матери всех сыновей на фронт. Сейчас же как при Сталине, в годы Великой Отечественной войны мать героиня Мария Матвеевна Фролова потеряла 8 сыновей из 12 на фронте."
                },
                {
                    title: "Я ОКОНЧИЛ ВОЕННУЮ КАФЕДРУ, НО ЗАБЫЛ ОФОРМИТЬ ВОЕННЫЙ БИЛЕТ. ПОДЛЕЖУ ЛИ Я МОБИЛИЗАЦИИ?",
                    content: "<b>Отвечаем:</b><br>Если в вузе военная кафедра была, военкомат автоматически зачисляет в запас. Получил после этого военный билет или нет, значения не имеет, мобилизации подлежит."
                },
                {
                    title: "Я СТАРШЕ 27 ЛЕТ, В АРМИИ НЕ СЛУЖИТ, НА УЧЁТЕ в ВОЕНКОМАТЕ НЕ СОСТОЮ, ВОЕННОГО БИЛЕТА НЕТ. ПОДЛЕЖУ ЛИ МОБИЛИЗАЦИИ?",
                    content: "<b>Отвечаем:</b><br>Формально должно быть решение призывной комиссии о зачислении в запас, его можно принять только в присутствии призывника и после медицинского освидетельствования. Поэтому те, кто, например, «прогулял» до 27 лет и не пришёл оформлять военный билет, находятся в «серой зоне». Законом эта ситуация не урегулирована. Не зачисленные в запас не могут получить повестку, следовательно, не могут быть мобилизованы."
                }
            ]
        }
    },
    methods: {
        async hider() {
            if(this.counts == 2) {
                this.counts = 100;
            } else {
                this.counts = 2;
            }
        },
		async closeModal() {
			this.$refs.modal_main.close();
		},
		async openModal() {
			this.$refs.modal_main.open();
		},
    }
}
</script>
<style lang="scss" scoped>
.faq {
    padding: 0px 0;
    padding-top: 80px;
    background-color: #f9f9f9;
    .accordion-title {
        //text-transform: lowercase;
    }
    &__accordion {
        //margin-bottom: 80px;
        position: relative;
        .accodion-overlay {
            //background-color: #1e90ff;
            background-image: linear-gradient(to top, #f9f9f9 20%, rgba(255,255,255,0));
            width: 100%;
            height: 150px;
            position: absolute;
            bottom: 0;
            z-index: 1;
        }
    }
    .image {
        width: 100%;
        height: 100%;
        display: flex;
        border-radius: $border-radius-small;
        overflow: hidden;
        //clip-path: polygon(93% 0, 100% 12%, 100% 100%, 0 100%, 0 0);
        //clip-path: polygon(10% 0, 100% 0, 100% 100%, 0 100%, 0 13%);
        //clip-path: polygon(80% 0, 100% 50%, 80% 100%, 0 100%, 0 0);
        //border-top-left-radius: 100px;
        //border-bottom-left-radius: 100px;
        //border-top-right-radius: 100px;
        //border-bottom-right-radius: 100px;
        img {
            width: auto;
            height: auto;
            max-width: 100%;
            max-height: 100%;
            object-fit: cover;
        }
    }
	img {
        width: 100%;
		position: absolute;
		bottom: 0; 
        z-index: 0;
	}
	.col {
		position: inherit;
	}
    .hider {
        display: flex;
        cursor: pointer;
        color: $bg-primary;
    }
}
@media screen and (max-width: 992px) {
    .faq {
        padding-top: 30px;
        img {
            display: none;
        }
        .accordion-title {
            font-size: 14px;
        }
    }
}
</style>