<template>
	<section class="secure">
		<base-modal ref="modal_main">
			<template v-slot:close>
				<div @click="closeModal">
					<base-icon name="thin/xmark" class="icon icon-close"></base-icon>
				</div>
			</template>
			<template v-slot:content>
				<div class="modal-content">
					<blocks-contact title="Получите ответ специалиста <br>прямо сейчас"></blocks-contact>
				</div>
			</template>
		</base-modal>

		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="title">
						<h3 class="mb-3">Защита интересов военнослужащих</h3>
					</div>
				</div>
			</div>
			<div class="row row-flex">
				<div class="col-12 col-md-4">
					<ul class="secure-menu">
						<template v-for="(item, i) in items">
							<li :key="i" :class="{active: i == selected}" @click="select(i)">{{item}}</li>
						</template>
					</ul>
				</div>
				<div class="col-12 col-md-8">
					<div class="secure-content" v-if="selected === 0">
						<h4 class="mb-4 line">Увольнение с военной службы</h4>
						<p>На сегодняшний день существует несколько способов уйти с военной службы по «положительным мотивам»:</p>
						<p>
							— в связи с достижением предельного возраста;
							<br />— в связи с оргштатными мероприятиями;
							<br />— в связи с признанием ВВК военнослужащего негодным по состоянию здоровья;
							<br />— по семейным обстоятельствам;
							<br />— в связи с переходом на службу в иные правоохранительные органы.
							<br />
							<br />Наша задача состоит в том, чтобы защитить нарушенные права военнослужащих при увольнении с военной службы, так как в ФЗ «О воинской обязанности и военной службе» нет такого основания как «по собственному желанию», поэтому наши юристы находят из указанных или иных оснований подход к увольнению без негативных последствий. Защита прав состоит из обращений в уполномоченные органы исполнительной власти, а также обращения в суды всех инстанций.
						</p>
					</div>
					<div class="secure-content" v-show="selected == 1">
						<h4 class="mb-4 line">Нарушение уставных правил взаимоотношений</h4>
						<p>Нередко на практике я сталкивался с ситуацией, когда военнослужащий причиняет вред здоровью другому военнослужащему (без признаков подчиненности), т.е. применяет насилие. Да вроде бы «поставил синяк» один другому, но в действительности это может служить поводом для возбуждения уголовного дела по статье 335 УК РФ — Нарушение уставных правил взаимоотношений между военнослужащими при отсутствии между ними отношений подчиненности, да и срок реальный — содержанием в дисциплинарной воинской части на срок до двух лет или лишением свободы на срок до трех лет.</p>
						<p>
							<br />Что же делать? Самое главное в данной ситуации вовремя обратиться к специализированному адвокату, который понимает какую именно тактику применить в Вашей ситуации.
							<br />Не надо медлить! Основные мероприятия (допросы, протоколы осмотра места происшествия, допросы свидетелей, приобщение доказательств, следственный эксперимент, назначения СМЭ, экспертизы и пр.) проводятся в первую очередь! Поэтому в случае, когда Вас защищает уверенный в своем деле адвокат вы понимаете, что все процессуальные мероприятия пройдут правильно.
							<br />Брать ли ст.51 Конституции РФ или дать показания! В каждой ситуации этот подход различен, только адвокат может подсказать вам какой метод необходимо избрать Вам.
							<br />Мера пресечения!
							<br />
							<br />Не забывайте, что в отношение подозреваемого может быть избрана мера пресечения:
							<br />1) подписка о невыезде;
							<br />2) личное поручительство;
							<br />3) наблюдение командования воинской части;
							<br />4) присмотр за несовершеннолетним обвиняемым;
							<br />4.1) запрет определенных действий;
							<br />5) залог;
							<br />6) домашний арест;
							<br />7) заключение под стражу.
						</p>
					</div>
					<div class="secure-content" v-show="selected == 2">
						<h4 class="mb-4 line">Оспаривание заключения аттестационной комиссии</h4>
						<p>
							<br />Поможем оспорить в суде заключение аттестационной комиссии.
							<br />Зачастую военнослужащего представляют на аттестационную комиссию для его увольнения. Но немногие знают, какие права есть у представленного к увольнению военного.
							<br />Юристы нашего центра разработали собственную методику защиты для наших доверителей при представлении в суде по вопросу оспаривания решения аттестационной комиссии.
							<br />
							<strong>Поясним, какими нормативно-правовыми актами руководствуются как члены аттестационной комиссии, так и сам военнослужащий:</strong>
							<br />1. Федеральный закон «О статусе военнослужащих» от 27.05.1998 N 76-ФЗ; (прописаны права военнослужащих, на которые можете сослаться);
							<br />2. Федеральный закон «О воинской обязанности и военной службе» от 28.03.1998 N 53-ФЗ (в нашем случае в этом НПА только ст. 51 увольнение с военной службы которая применяется для корректного указания основания для увольнения)
							<br />3. Указ Президента РФ от 16 сентября 1999 г. N 1237 «Вопросы прохождения военной службы» (этот НПА подробно поясняет этапы увольнения со службы);
							<br />4. Приказ Министра обороны РФ от 29 февраля 2012 г. N 444 «О порядке организации и проведения аттестации военнослужащих, проходящих военную службу по контракту в Вооруженных Силах Российской Федерации» (этот НПА подробно описывает порядок проведения аттестации).
							<br />
							<strong>Так, например, некоторые, но частые нарушения со стороны командования:</strong>
							<br />— несвоевременное ознакомление с представлением на увольнение,
							<br />— не тот состав аттестационный комиссии который утвержден руководством и пр.
							<br />Что делать, если Вас представляют или представили на заседание аттестационной комиссии:
							<br />во-первых, обязательно (по возможности) делать копии текста заключения комиссии,
							<br />во-вторых, в случае не согласия с выводами обязательно указывать это письменно,
							<br />в-третьих, не ждать и лучше не пытаться самостоятельно противостоять руководству т.к. Вы можете пропустить срок для обжалования, который составляет 3 месяца или неправильно выбрать способ защиты нарушенного права.
							<br />Также хотим прояснить вопрос по поводу возмещения судебных расходов, которые согласно процессуального законодательства взыскиваются с ответчика, поэтому все расходы на юристов, нотариусов, экспертизы подлежат взысканию в установленном порядке.
						</p>
					</div>
					<div class="secure-content" v-show="selected == 3">
						<h4 class="mb-4 line">Получение жилья</h4>
						<p>
							<span>
								В настоящее время в Вооруженных Силах РФ существует несколько способов получения жилья военнослужащим:-приобретение постоянного жилья;
								<br />-жилищная субсидия;
								<br />-государственный жилищный сертификат;
								<br />-участие военнослужащего в программе Накопительно-ипотечной системы.
								<br />Наша задача состоит в том, чтобы защитить нарушенные права военнослужащих при реализации военнослужащими своим прав на жилье. Защита прав состоит из обращений в уполномоченные органы исполнительной власти, а также обращения в суды всех инстанций.
							</span>
						</p>
					</div>
					<div class="secure-content" v-show="selected == 4">
						<h4 class="mb-4 line">Денежное довольствие</h4>
						<p>
							<span>
								Денежное довольствие является средством материального обеспечения военнослужащего при исполнении им своих служебных обязанностей.
								<br />Основные вопросы, возникающие у военнослужащих по денежному довольствию:
								<br />— выплата части денежного довольствия или невыплата;
								<br />— несвоевременная выплата денежного довольствия;
								<br />— неполучение военнослужащим материальной помощи после обращения.
								<br />Наша задача восполнить нарушенное право военнослужащего путем обращения в уполномоченные органы исполнительной власти, а также обращения в суды всех инстанций.
							</span>
						</p>
					</div>
					<div class="secure-content" v-show="selected == 5">
						<h4 class="mb-4 line">Семья военнослужащего</h4>
						<p>
							<span>
								Нередки случаи возникновения юридических вопросов у членов семьи военнослужащего. Основные виды вопросов у членов семьи военнослужащего:
								<br />— преимущественное право супруги военнослужащего при уходе в очередной отпуск;- определение ребенка в детский сад или в школу;- выплаты семьям военнослужащим при переезде к новому месту службы и что при этом полагается семье;- взыскание алиментов на ребенка, если отец военнослужащий;- расторжение брака и раздел имущества (приобретенного по военной ипотеки или иным образом).
							</span>
						</p>
					</div>
					<div class="secure-content" v-show="selected == 6">
						<h4 class="mb-4 line">Страховые вопросы</h4>
						<p>
							<span>
								В процессе службы у военнослужащих бывают случаи невозможности исполнения ими служебных обязанностей вследствие наступления негативных событий и в результате получения травмы или увечья.
								<br />Основные случаи для выплаты страхового возмещения военнослужащим:
								<br />— возмещение вреда в случае гибели (смерти) военнослужащего; — возмещение вреда вследствие нарушения здоровья или потери трудоспособности;- установление инвалидности; — получение увечий (ранений, травм, контузий), относящихся к тяжелым или легким, досрочное увольнения с военной службы.
							</span>
						</p>
					</div>
					<div class="secure-content" v-show="selected == 7">
						<h4 class="mb-4 line"></h4>
					</div>
				</div>
			</div>
		</div>
	</section>
</template>
<script>
export default {
	data() {
		return {
			counts: 2,
			selected: 0,
			items: [
				"Увольнение с военной службы",
				"Нарушение уставных правил взаимоотношений",
				"Оспаривание заключения аттестационной комиссии",
				"Получение жилья",
				"Денежное довольствие",
				//"Ответственность военнослужащих",
				//"Военный контракт",
				"Семья военнослужащего",
				"Страховые вопросы",
			],
		};
	},
	methods: {
		async select(index) {
			this.selected = index;
		},
		async hider() {
			if (this.counts == 2) {
				this.counts = 100;
			} else {
				this.counts = 2;
			}
		},
		async closeModal() {
			this.$refs.modal_main.close();
		},
		async openModal() {
			this.$refs.modal_main.open();
		},
	},
};
</script>
<style lang="scss" scoped>
.secure {
	padding: 80px 0;
	background-color: #f9f9f9;

	.title {
		padding-left: 30px;
		border-left: 4px solid $bg-primary;
		margin-bottom: 50px;
	}

	.secure-menu {
		padding-top: 0px;
		width: 100%;
		padding-right: 30px;
		li {
			padding: 15px 30px;
			margin-bottom: 5px;
			cursor: pointer;
			background-color: #fff;
			border: 3px solid transparent;
			//transition: 0.1s;
			p {
				line-height: 25px;
			}
			&:hover {
				border: 3px solid rgba(var(--text-secondary), 0.4);
			}
			&.active {
				border: 3px solid transparent;
				background-color: rgba(var(--text-secondary), 0.65);
				color: #fff;
			}
		}
	}

	.secure-content {
		//background-color: #fff;
		h4 {
			font-size: 28px;
			margin-left: 30px;
		}
		p {
			margin-top: 15px;
			line-height: 20px;
		}
	}
}

@media screen and (max-width: 992px) {
	.secure {
		.secure-menu {
			width: 100%;
			display: flex;
			flex-direction: row;
			margin-bottom: 30px;
			overflow-x: scroll;
			li {
				//min-width: 220px;
				padding: 8px 15px;
				margin: 0;
				margin-right: 10px;
				display: flex;
				justify-content: center;
				align-items: center;
				font-size: 14px;
				background-color: #eee;
			}
		}
	}
}
</style>